Repository: Adarsh-oo7/Agrichain
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ml

source: AGRICHAIN has transformed the way I farm. The real-time data and predictive analytics have helped me make better decisions and increase my yield.
ml: AGRICHAIN എന്റെ കൃഷി രീതി മാറ്റിമറിച്ചു. റിയൽ-ടൈം ഡാറ്റയും പ്രെഡിക്റ്റീവ് അനലിറ്റിക്സും എന്നെ മികച്ച തീരുമാനങ്ങൾ എടുക്കാനും എന്റെ ഉൽപ്പാദനം വർദ്ധിപ്പിക്കാനും സഹായിച്ചു.

source: Rajesh Kumar
ml: രാജേഷ് കുമാർ

source: Farmer, Punjab
ml: കർഷകൻ, പഞ്ചാബ്

source: The direct marketplace has been a game-changer for me. I no longer rely on middlemen, and my profits have increased significantly.
ml: നേരിട്ടുള്ള മാർക്കറ്റ്പ്ലേസ് എനിക്ക് ഒരു ഗെയിം-ചേഞ്ചർ ആയിരുന്നു. ഇനി ഞാൻ മിഡിൽമെൻമാരെ ആശ്രയിക്കുന്നില്ല, എന്റെ ലാഭം ഗണ്യമായി വർദ്ധിച്ചിട്ടുണ്ട്.

source: Priya Sharma
ml: പ്രിയ ശർമ്മ

source: Farmer, Maharashtra
ml: കർഷകൻ, മഹാരാഷ്ട്ര

source: The climatic and soil forecasting tools have helped me adapt to changing conditions and improve my crop resilience.
ml: കാലാവസ്ഥയും മണ്ണിന്റെ പ്രവചന ഉപകരണങ്ങളും മാറിക്കൊണ്ടിരിക്കുന്ന അവസ്ഥകളിലേക്ക് ഇണങ്ങാനും എന്റെ ക്രോപ്പ് പ്രതിരോധശേഷി മെച്ചപ്പെടുത്താനും സഹായിച്ചു.

source: Anil Patel
ml: അനിൽ പട്ടേൽ

source: Farmer, Gujarat
ml: കർഷകൻ, ഗുജറാത്ത്

source: Join AGRICHAIN Today
ml: ഇന്ന് AGRICHAIN-ൽ ചേരുക

source: Empower your farming journey with real-time data, predictive analytics, and direct market access. Register now to get started!
ml: റിയൽ-ടൈം ഡാറ്റ, പ്രെഡിക്റ്റീവ് അനലിറ്റിക്സ്, നേരിട്ടുള്ള മാർക്കറ്റ് ആക്സസ് എന്നിവ ഉപയോഗിച്ച് നിങ്ങളുടെ കൃഷി യാത്ര ശക്തിപ്പെടുത്തുക. ആരംഭിക്കാൻ ഇപ്പോൾ രജിസ്റ്റർ ചെയ്യുക!

source: Register Now
ml: ഇപ്പോൾ രജിസ്റ്റർ ചെയ്യുക
