Repository: Adarsh-oo7/Agrichain
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ml

source: English
ml: ഇംഗ്ലീഷ്

source: Malayalam
ml: മലയാളം

source: Messages
ml: സന്ദേശങ്ങൾ

source: Site Maps
ml: സൈറ്റ് മാപ്പുകൾ

source: Static Files
ml: സ്റ്റാറ്റിക് ഫയലുകൾ

source: Syndication
ml: സിന്ഡിക്കേഷൻ

source: That page number is not an integer
ml: ആ പേജ് നമ്പർ ഒരു പൂർണ്ണസംഖ്യ അല്ല

source: That page number is less than 1
ml: ആ പേജ് നമ്പർ 1-ൽ കുറവാണ്

source: That page contains no results
ml: ആ പേജിൽ ഫലങ്ങൾ ഇല്ല

source: Enter a valid value.
ml: ഒരു സാധുവായ മൂല്യം നൽകുക.

source: Enter a valid domain name.
ml: ഒരു സാധുവായ ഡൊമെയ്ൻ നാമം നൽകുക.

source: Enter a valid URL.
ml: ഒരു സാധുവായ URL നൽകുക.

source: Enter a valid integer.
ml: ഒരു സാധുവായ പൂർണ്ണസംഖ്യ നൽകുക.

source: Enter a valid email address.
ml: ഒരു സാധുവായ ഇമെയിൽ വിലാസം നൽകുക.

source: Enter a valid slug consisting of letters, numbers, underscores or hyphens.
ml: അക്ഷരങ്ങൾ, നമ്പറുകൾ, അണ്ടർസ്കോറുകൾ അല്ലെങ്കിൽ ഹൈഫനുകൾ ഉൾപ്പെടുന്ന ഒരു സാധുവായ സ്ലഗ് നൽകുക.

source: Enter a valid slug consisting of Unicode letters, numbers, underscores, or hyphens.
ml: യൂണികോഡ് അക്ഷരങ്ങൾ, നമ്പറുകൾ, അണ്ടർസ്കോറുകൾ അല്ലെങ്കിൽ ഹൈഫനുകൾ ഉൾപ്പെടുന്ന ഒരു സാധുവായ സ്ലഗ് നൽകുക.

source: Enter a valid %(protocol)s address.
ml: ഒരു സാധുവായ %(protocol)s വിലാസം നൽകുക.

source: IPv4 or IPv6
ml: IPv4 അല്ലെങ്കിൽ IPv6

source: Enter only digits separated by commas.
ml: കോമകളാൽ വേർതിരിച്ച അക്കങ്ങൾ മാത്രം നൽകുക.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ml: ഈ മൂല്യം %(limit_value)s ആണെന്ന് ഉറപ്പാക്കുക (ഇത് %(show_value)s ആണ്).

source: Ensure this value is less than or equal to %(limit_value)s.
ml: ഈ മൂല്യം %(limit_value)s-ൽ കുറവോ തുല്യമോ ആണെന്ന് ഉറപ്പാക്കുക.

source: Ensure this value is greater than or equal to %(limit_value)s.
ml: ഈ മൂല്യം %(limit_value)s-ൽ കൂടുതലോ തുല്യമോ ആണെന്ന് ഉറപ്പാക്കുക.

source: Ensure this value is a multiple of step size %(limit_value)s.
ml: ഈ മൂല്യം %(limit_value)s ഘട്ടം വലുപ്പത്തിന്റെ ഒരു ഗുണിതമാണെന്ന് ഉറപ്പാക്കുക.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ml: ഈ മൂല്യം %(limit_value)s ഘട്ടം വലുപ്പത്തിന്റെ ഒരു ഗുണിതമാണെന്ന് ഉറപ്പാക്കുക, %(offset)s-ൽ നിന്ന് ആരംഭിക്കുന്നു, ഉദാ. %(offset)s, %(valid_value1)s, %(valid_value2)s, തുടങ്ങിയവ.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
ml: ഈ മൂല്യത്തിന് കുറഞ്ഞത് %(limit_value)d അക്ഷരമെങ്കിലും ഉണ്ടെന്ന് ഉറപ്പാക്കുക (ഇതിന് %(show_value)d ഉണ്ട്).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
ml: ഈ മൂല്യത്തിന് കൂടുതൽ %(limit_value)d അക്ഷരമെങ്കിലും ഉണ്ടെന്ന് ഉറപ്പാക്കുക (ഇതിന് %(show_value)d ഉണ്ട്).

source: Enter a number.
ml: ഒരു നമ്പർ നൽകുക.

source: Ensure that there are no more than %(max)s digit in total.
ml: ആകെ %(max)s അക്കത്തിൽ കൂടുതൽ ഇല്ലെന്ന് ഉറപ്പാക്കുക.

source: Ensure that there are no more than %(max)s decimal place.
ml: ആകെ %(max)s ദശാംശ സ്ഥാനത്തിൽ കൂടുതൽ ഇല്ലെന്ന് ഉറപ്പാക്കുക.

source: Ensure that there are no more than %(max)s digit before the decimal point.
ml: ദശാംശ ബിന്ദുവിന് മുമ്പ് %(max)s അക്കത്തിൽ കൂടുതൽ ഇല്ലെന്ന് ഉറപ്പാക്കുക.

source: File extension %(extension)s is not allowed. Allowed extensions are: %(allowed_extensions)s.
ml: ഫയൽ എക്സ്റ്റൻഷൻ %(extension)s അനുവദനീയമല്ല. അനുവദനീയമായ എക്സ്റ്റൻഷനുകൾ: %(allowed_extensions)s.

source: Null characters are not allowed.
ml: നൾ അക്ഷരങ്ങൾ അനുവദനീയമല്ല.

source: and
ml: ഒപ്പം

source: %(model_name)s with this %(field_labels)s already exists.
ml: ഈ %(field_labels)s ഉള്ള %(model_name)s ഇതിനകം തന്നെ നിലവിലുണ്ട്.

source: Constraint %(name)s is violated.
ml: നിയന്ത്രണം %(name)s ലംഘിക്കപ്പെട്ടു.

source: Value %(value)r is not a valid choice.
ml: മൂല്യം %(value)r ഒരു സാധുവായ ചോയ്സ് അല്ല.

source: This field cannot be null.
ml: ഈ ഫീൽഡ് ശൂന്യമാകാൻ പാടില്ല.

source: This field cannot be blank.
ml: ഈ ഫീൽഡ് ശൂന്യമാകാൻ പാടില്ല.

source: %(model_name)s with this %(field_label)s already exists.
ml: ഈ %(field_label)s ഉള്ള %(model_name)s ഇതിനകം തന്നെ നിലവിലുണ്ട്.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
ml: %(date_field_label)s %(lookup_type)s-ന് %(field_label)s അദ്വിതീയമായിരിക്കണം.

source: Field of type: %(field_type)s
ml: ഫീൽഡ് തരം: %(field_type)s

source: %(value)s value must be either True or False.
ml: %(value)s മൂല്യം ഒന്നുകിൽ True അല്ലെങ്കിൽ False ആയിരിക്കണം.

source: %(value)s value must be either True, False, or None.
ml: %(value)s മൂല്യം ഒന്നുകിൽ True, False, അല്ലെങ്കിൽ None ആയിരിക്കണം.

source: Boolean (Either True or False)
ml: ബൂളിയൻ (ഒന്നുകിൽ True അല്ലെങ്കിൽ False)

source: String (up to %(max_length)s)
ml: സ്ട്രിംഗ് (കൂടുതൽ %(max_length)s വരെ)

source: String (unlimited)
ml: സ്ട്രിംഗ് (അപരിമിതം)

source: Comma-separated integers
ml: കോമകളാൽ വേർതിരിച്ച പൂർണ്ണസംഖ്യകൾ

source: %(value)s value has an invalid date format. It must be in YYYY-MM-DD format.
ml: %(value)s മൂല്യത്തിന് അസാധുവായ തീയതി ഫോർമാറ്റ് ഉണ്ട്. ഇത് YYYY-MM-DD ഫോർമാറ്റിൽ ആയിരിക്കണം.

source: %(value)s value has the correct format (YYYY-MM-DD) but it is an invalid date.
ml: %(value)s മൂല്യത്തിന് ശരിയായ ഫോർമാറ്റ് (YYYY-MM-DD) ഉണ്ട്, പക്ഷേ ഇത് അസാധുവായ തീയതിയാണ്.

source: Date (without time)
ml: തീയതി (സമയം ഇല്ലാതെ)

source: %(value)s value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
ml: %(value)s മൂല്യത്തിന് അസാധുവായ ഫോർമാറ്റ് ഉണ്ട്. ഇത് YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] ഫോർമാറ്റിൽ ആയിരിക്കണം.

source: %(value)s value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
ml: %(value)s മൂല്യത്തിന് ശരിയായ ഫോർമാറ്റ് (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) ഉണ്ട്, പക്ഷേ ഇത് അസാധുവായ തീയതി/സമയമാണ്.

source: Date (with time)
ml: തീയതി (സമയം ഉള്ള)

source: %(value)s value must be a decimal number.
ml: %(value)s മൂല്യം ഒരു ദശാംശ സംഖ്യയായിരിക്കണം.

source: Decimal number
ml: ദശാംശ സംഖ്യ

source: %(value)s value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
ml: %(value)s മൂല്യത്തിന് അസാധുവായ ഫോർമാറ്റ് ഉണ്ട്. ഇത് [DD] [[HH:]MM:]ss[.uuuuuu] ഫോർമാറ്റിൽ ആയിരിക്കണം.

source: Duration
ml: കാലാവധി

source: Email address
ml: ഇമെയിൽ വിലാസം

source: File path
ml: ഫയൽ പാത

source: %(value)s value must be a float.
ml: %(value)s മൂല്യം ഒരു ഫ്ലോട്ട് ആയിരിക്കണം.

source: Floating point number
ml: ഫ്ലോട്ടിംഗ് പോയിന്റ് നമ്പർ

source: %(value)s value must be an integer.
ml: %(value)s മൂല്യം ഒരു പൂർണ്ണസംഖ്യയായിരിക്കണം.

source: Integer
ml: പൂർണ്ണസംഖ്യ

source: Big (8 byte) integer
ml: വലിയ (8 ബൈറ്റ്) പൂർണ്ണസംഖ്യ

source: Small integer
ml: ചെറിയ പൂർണ്ണസംഖ്യ

source: IPv4 address
ml: IPv4 വിലാസം

source: IP address
ml: IP വിലാസം

source: %(value)s value must be either None, True or False.
ml: %(value)s മൂല്യം ഒന്നുകിൽ None, True അല്ലെങ്കിൽ False ആയിരിക്കണം.

source: Boolean (Either True, False or None)
ml: ബൂളിയൻ (ഒന്നുകിൽ True, False അല്ലെങ്കിൽ None)

source: Positive big integer
ml: പോസിറ്റീവ് വലിയ പൂർണ്ണസംഖ്യ

source: Positive integer
ml: പോസിറ്റീവ് പൂർണ്ണസംഖ്യ

source: Positive small integer
ml: പോസിറ്റീവ് ചെറിയ പൂർണ്ണസംഖ്യ

source: Slug (up to %(max_length)s)
ml: സ്ലഗ് (കൂടുതൽ %(max_length)s വരെ)

source: Text
ml: ടെക്സ്റ്റ്

source: %(value)s value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
ml: %(value)s മൂല്യത്തിന് അസാധുവായ ഫോർമാറ്റ് ഉണ്ട്. ഇത് HH:MM[:ss[.uuuuuu]] ഫോർമാറ്റിൽ ആയിരിക്കണം.

source: %(value)s value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
ml: %(value)s മൂല്യത്തിന് ശരിയായ ഫോർമാറ്റ് (HH:MM[:ss[.uuuuuu]]) ഉണ്ട്, പക്ഷേ ഇത് അസാധുവായ സമയമാണ്.

source: Time
ml: സമയം

source: Raw binary data
ml: റോ ബൈനറി ഡാറ്റ

source: %(value)s is not a valid UUID.
ml: %(value)s ഒരു സാധുവായ UUID അല്ല.

source: Universally unique identifier
ml: യൂണിവേഴ്സൽ യൂണിക് ഐഡന്റിഫയർ

source: File
ml: ഫയൽ

source: Image
ml: ഇമേജ്

source: A JSON object
ml: ഒരു JSON ഒബ്ജക്റ്റ്

source: Value must be valid JSON.
ml: മൂല്യം സാധുവായ JSON ആയിരിക്കണം.

source: %(model)s instance with %(field)s %(value)r does not exist.
ml: %(field)s %(value)r ഉള്ള %(model)s ഇൻസ്റ്റൻസ് നിലവിലില്ല.

source: Foreign Key (type determined by related field)
ml: ഫോറിൻ കീ (തരം ബന്ധപ്പെട്ട ഫീൽഡ് നിർണ്ണയിക്കുന്നു)

source: One-to-one relationship
ml: ഒന്ന്-ടു-ഒന്ന് ബന്ധം

source: %(from)s-%(to)s relationship
ml: %(from)s-%(to)s ബന്ധം

source: %(from)s-%(to)s relationships
ml: %(from)s-%(to)s ബന്ധങ്ങൾ

source: Many-to-many relationship
ml: മനി-ടു-മനി ബന്ധം

source: This field is required.
ml: ഈ ഫീൽഡ് ആവശ്യമാണ്.

source: Enter a whole number.
ml: ഒരു പൂർണ്ണസംഖ്യ നൽകുക.

source: Enter a valid date.
ml: ഒരു സാധുവായ തീയതി നൽകുക.

source: Enter a valid time.
ml: ഒരു സാധുവായ സമയം നൽകുക.

source: Enter a valid date/time.
ml: ഒരു സാധുവായ തീയതി/സമയം നൽകുക.

source: Enter a valid duration.
ml: ഒരു സാധുവായ കാലാവധി നൽകുക.

source: The number of days must be between {min_days} and {max_days}.
ml: ദിവസങ്ങളുടെ എണ്ണം {min_days} നും {max_days} നും ഇടയിൽ ആയിരിക്കണം.

source: No file was submitted. Check the encoding type on the form.
ml: ഒരു ഫയലും സമർപ്പിച്ചിട്ടില്ല. ഫോമിലെ എൻകോഡിംഗ് തരം പരിശോധിക്കുക.

source: No file was submitted.
ml: ഒരു ഫയലും സമർപ്പിച്ചിട്ടില്ല.

source: The submitted file is empty.
ml: സമർപ്പിച്ച ഫയൽ ശൂന്യമാണ്.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
ml: ഈ ഫയൽനാമത്തിന് കൂടുതൽ %(max)d അക്ഷരമെങ്കിലും ഉണ്ടെന്ന് ഉറപ്പാക്കുക (ഇതിന് %(length)d ഉണ്ട്).

source: Please either submit a file or check the clear checkbox, not both.
ml: ദയവായി ഒന്നുകിൽ ഒരു ഫയൽ സമർപ്പിക്കുക അല്ലെങ്കിൽ ക്ലിയർ ചെക്ക്ബോക്സ് ചെക്ക് ചെയ്യുക, രണ്ടും അല്ല.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ml: ഒരു സാധുവായ ഇമേജ് അപ്‌ലോഡ് ചെയ്യുക. നിങ്ങൾ അപ്‌ലോഡ് ചെയ്ത ഫയൽ ഒന്നുകിൽ ഒരു ഇമേജ് അല്ല അല്ലെങ്കിൽ ഒരു കേടുപാടുള്ള ഇമേജ് ആണ്.

source: Select a valid choice. %(value)s is not one of the available choices.
ml: ഒരു സാധുവായ ചോയ്സ് തിരഞ്ഞെടുക്കുക. %(value)s ലഭ്യമായ ചോയ്സുകളിൽ ഒന്നല്ല.

source: Enter a list of values.
ml: മൂല്യങ്ങളുടെ ഒരു ലിസ്റ്റ് നൽകുക.

source: Enter a complete value.
ml: ഒരു പൂർണ്ണ മൂല്യം നൽകുക.

source: Enter a valid UUID.
ml: ഒരു സാധുവായ UUID നൽകുക.

source: Enter a valid JSON.
ml: ഒരു സാധുവായ JSON നൽകുക.

source: (Hidden field %(name)s) %(error)s
ml: (മറഞ്ഞിരിക്കുന്ന ഫീൽഡ് %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
ml: ManagementForm ഡാറ്റ കാണുന്നില്ല അല്ലെങ്കിൽ തിരുത്തപ്പെട്ടിട്ടുണ്ട്. കാണാതായ ഫീൽഡുകൾ: %(field_names)s. പ്രശ്നം തുടരുകയാണെങ്കിൽ നിങ്ങൾ ഒരു ബഗ് റിപ്പോർട്ട് ഫയൽ ചെയ്യേണ്ടിവരും.

source: Please submit at most %(num)d form.
ml: ദയവായി കൂടുതൽ %(num)d ഫോം സമർപ്പിക്കുക.

source: Please submit at least %(num)d form.
ml: ദയവായി കുറഞ്ഞത് %(num)d ഫോം സമർപ്പിക്കുക.

source: Order
ml: ഓർഡർ

source: Delete
ml: ഇല്ലാതാക്കുക

source: Please correct the duplicate data for %(field)s.
ml: ദയവായി %(field)s-നുള്ള ഡ്യൂപ്ലിക്കേറ്റ് ഡാറ്റ ശരിയാക്കുക.

source: Please correct the duplicate data for %(field)s, which must be unique.
ml: ദയവായി %(field)s-നുള്ള ഡ്യൂപ്ലിക്കേറ്റ് ഡാറ്റ ശരിയാക്കുക, അത് അദ്വിതീയമായിരിക്കണം.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
ml: ദയവായി %(field_name)s-നുള്ള ഡ്യൂപ്ലിക്കേറ്റ് ഡാറ്റ ശരിയാക്കുക, അത് %(date_field)s-ലെ %(lookup)s-ന് അദ്വിതീയമായിരിക്കണം.

source: Please correct the duplicate values below.
ml: ദയവായി താഴെയുള്ള ഡ്യൂപ്ലിക്കേറ്റ് മൂല്യങ്ങൾ ശരിയാക്കുക.

source: The inline value did not match the parent instance.
ml: ഇൻലൈൻ മൂല്യം പാരന്റ് ഇൻസ്റ്റൻസുമായി പൊരുത്തപ്പെടുന്നില്ല.

source: Select a valid choice. That choice is not one of the available choices.
ml: ഒരു സാധുവായ ചോയ്സ് തിരഞ്ഞെടുക്കുക. ആ ചോയ്സ് ലഭ്യമായ ചോയ്സുകളിൽ ഒന്നല്ല.

source: %(pk)s is not a valid value.
ml: %(pk)s ഒരു സാധുവായ മൂല്യമല്ല.

source: %(datetime)s couldnt be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
ml: %(datetime)s-നെ %(current_timezone)s സമയ മേഖലയിൽ വ്യാഖ്യാനിക്കാൻ കഴിഞ്ഞില്ല; ഇത് അസ്പഷ്ടമായിരിക്കാം അല്ലെങ്കിൽ നിലവിലില്ലാതെയിരിക്കാം.

source: Clear
ml: ക്ലിയർ

source: Currently
ml: നിലവിൽ

source: Change
ml: മാറ്റം

source: Unknown
ml: അജ്ഞാതം

source: Yes
ml: അതെ

source: No
ml: ഇല്ല

source: yes,no,maybe
ml: അതെ,ഇല്ല,ഒരുപക്ഷേ

source: %(size)d byte
ml: %(size)d ബൈറ്റ്

source: p.m.
ml: പി.എം.

source: a.m.
ml: എ.എം.

source: midnight
ml: മിഡ്നൈറ്റ്

source: noon
ml: നൂൺ

source: Monday
ml: തിങ്കൾ

source: Tuesday
ml: ചൊവ്വ

source: Wednesday
ml: ബുധൻ

source: Thursday
ml: വ്യാഴം

source: Friday
ml: വെള്ളി

source: Saturday
ml: ശനി

source: Sunday
ml: ഞായർ

source: Mon
ml: തിങ്കൾ

source: Tue
ml: ചൊവ്വ

source: Wed
ml: ബുധൻ

source: Thu
ml: വ്യാഴം

source: Fri
ml: വെള്ളി

source: Sat
ml: ശനി

source: Sun
ml: ഞായർ

source: January
ml: ജനുവരി

source: February
ml: ഫെബ്രുവരി

source: March
ml: മാർച്ച്

source: April
ml: ഏപ്രിൽ

source: May
ml: മെയ്

source: June
ml: ജൂൺ

source: July
ml: ജൂലൈ

source: August
ml: ഓഗസ്റ്റ്

source: September
ml: സെപ്റ്റംബർ

source: October
ml: ഒക്ടോബർ

source: November
ml: നവംബർ

source: December
ml: ഡിസംബർ

source: jan
ml: ജനു

source: feb
ml: ഫെബ്

source: mar
ml: മാർ

source: apr
ml: ഏപ്രിൽ

source: may
ml: മെയ്

source: jun
ml: ജൂൺ

source: jul
ml: ജൂലൈ

source: aug
ml: ഓഗ

source: sep
ml: സെപ്

source: oct
ml: ഒക്ടോ

source: nov
ml: നവം

source: dec
ml: ഡിസം

# abbrev. month
source: Jan.
ml: ജനു.

# abbrev. month
source: Feb.
ml: ഫെബ്.

# abbrev. month
source: March
ml: മാർച്ച്

# abbrev. month
source: April
ml: ഏപ്രിൽ

# abbrev. month
source: May
ml: മെയ്

# abbrev. month
source: June
ml: ജൂൺ

# abbrev. month
source: July
ml: ജൂലൈ

# abbrev. month
source: Aug.
ml: ഓഗ.

# abbrev. month
source: Sept.
ml: സെപ്റ്റം.

# abbrev. month
source: Oct.
ml: ഒക്ടോ.

# abbrev. month
source: Nov.
ml: നവം.

# abbrev. month
source: Dec.
ml: ഡിസം.

# alt. month
source: January
ml: ജനുവരി

# alt. month
source: February
ml: ഫെബ്രുവരി

# alt. month
source: March
ml: മാർച്ച്

# alt. month
source: April
ml: ഏപ്രിൽ

# alt. month
source: May
ml: മെയ്

# alt. month
source: June
ml: ജൂൺ

# alt. month
source: July
ml: ജൂലൈ

# alt. month
source: August
ml: ഓഗസ്റ്റ്

# alt. month
source: September
ml: സെപ്റ്റംബർ

# alt. month
source: October
ml: ഒക്ടോബർ

# alt. month
source: November
ml: നവംബർ

# alt. month
source: December
ml: ഡിസംബർ

source: This is not a valid IPv6 address.
ml: ഇത് ഒരു സാധുവായ IPv6 വിലാസമല്ല.

source: or
ml: അല്ലെങ്കിൽ

source: %(num)d year
ml: %(num)d വർഷം

source: %(num)d month
ml: %(num)d മാസം

source: %(num)d week
ml: %(num)d ആഴ്ച

source: %(num)d day
ml: %(num)d ദിവസം

source: %(num)d hour
ml: %(num)d മണിക്കൂർ

source: %(num)d minute
ml: %(num)d മിനിറ്റ്

source: Forbidden
ml: നിഷിദ്ധം

source: CSRF verification failed. Request aborted.
ml: CSRF പരിശോധന പരാജയപ്പെട്ടു. അഭ്യർത്ഥന ഉപേക്ഷിച്ചു.

source: You are seeing this message because this HTTPS site requires a Referer header to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ml: നിങ്ങൾ ഈ സന്ദേശം കാണുന്നത് ഈ HTTPS സൈറ്റിന് നിങ്ങളുടെ വെബ് ബ്രൗസർ ഒരു Referer ഹെഡർ അയയ്ക്കേണ്ടതുണ്ട്, പക്ഷേ ഒന്നും അയയ്ക്കപ്പെട്ടിട്ടില്ല. നിങ്ങളുടെ ബ്രൗസർ മൂന്നാം കക്ഷികൾ ഹൈജാക്ക് ചെയ്യപ്പെടുന്നില്ലെന്ന് ഉറപ്പാക്കാൻ സുരക്ഷാ കാരണങ്ങളാൽ ഈ ഹെഡർ ആവശ്യമാണ്.

source: If you have configured your browser to disable Referer headers, please re-enable them, at least for this site, or for HTTPS connections, or for same-origin requests.
ml: നിങ്ങളുടെ ബ്രൗസർ Referer ഹെഡറുകൾ പ്രവർത്തനരഹിതമാക്കാൻ കോൺഫിഗർ ചെയ്തിട്ടുണ്ടെങ്കിൽ, ദയവായി അവ വീണ്ടും പ്രവർത്തനക്ഷമമാക്കുക, കുറഞ്ഞത് ഈ സൈറ്റിന്, അല്ലെങ്കിൽ HTTPS കണക്ഷനുകൾക്ക്, അല്ലെങ്കിൽ സെയ്‌ം-ഓറിജിൻ അഭ്യർത്ഥനകൾക്ക്.

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the Referrer-Policy: no-referrer header, please remove them. The CSRF protection requires the Referer header to do strict referer checking. If youre concerned about privacy, use alternatives like <a rel="noreferrer" > for links to third-party sites.
ml: നിങ്ങൾ <meta name="referrer" content="no-referrer"> ടാഗ് ഉപയോഗിക്കുകയോ Referrer-Policy: no-referrer ഹെഡർ ഉൾപ്പെടുത്തുകയോ ചെയ്യുന്നുവെങ്കിൽ, ദയവായി അവ നീക്കം ചെയ്യുക. CSRF സംരക്ഷണത്തിന് കർശനമായ റഫറർ പരിശോധന നടത്താൻ Referer ഹെഡർ ആവശ്യമാണ്. നിങ്ങൾക്ക് സ്വകാര്യതയെക്കുറിച്ച് ആശങ്കയുണ്ടെങ്കിൽ, മൂന്നാം കക്ഷി സൈറ്റുകളിലേക്കുള്ള ലിങ്കുകൾക്ക് <a rel="noreferrer" > പോലുള്ള ബദലുകൾ ഉപയോഗിക്കുക.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ml: നിങ്ങൾ ഈ സന്ദേശം കാണുന്നത് ഈ സൈറ്റിന് ഫോമുകൾ സമർപ്പിക്കുമ്പോൾ ഒരു CSRF കുക്കി ആവശ്യമാണ്. നിങ്ങളുടെ ബ്രൗസർ മൂന്നാം കക്ഷികൾ ഹൈജാക്ക് ചെയ്യപ്പെടുന്നില്ലെന്ന് ഉറപ്പാക്കാൻ സുരക്ഷാ കാരണങ്ങളാൽ ഈ കുക്കി ആവശ്യമാണ്.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for same-origin requests.
ml: നിങ്ങളുടെ ബ്രൗസർ കുക്കികൾ പ്രവർത്തനരഹിതമാക്കാൻ കോൺഫിഗർ ചെയ്തിട്ടുണ്ടെങ്കിൽ, ദയവായി അവ വീണ്ടും പ്രവർത്തനക്ഷമമാക്കുക, കുറഞ്ഞത് ഈ സൈറ്റിന്, അല്ലെങ്കിൽ സെയ്‌ം-ഓറിജിൻ അഭ്യർത്ഥനകൾക്ക്.

source: More information is available with DEBUG=True.
ml: കൂടുതൽ വിവരങ്ങൾ DEBUG=True ഉപയോഗിച്ച് ലഭ്യമാണ്.

source: No year specified
ml: വർഷം വ്യക്തമാക്കിയിട്ടില്ല

source: Date out of range
ml: തീയതി പരിധിയിൽ ഇല്ല

source: No month specified
ml: മാസം വ്യക്തമാക്കിയിട്ടില്ല

source: No day specified
ml: ദിവസം വ്യക്തമാക്കിയിട്ടില്ല

source: No week specified
ml: ആഴ്ച വ്യക്തമാക്കിയിട്ടില്ല

source: No %(verbose_name_plural)s available
ml: %(verbose_name_plural)s ലഭ്യമല്ല

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
ml: %(class_name)s.allow_future False ആയതിനാൽ ഭാവിയിലെ %(verbose_name_plural)s ലഭ്യമല്ല.

source: Invalid date string %(datestr)s given format %(format)s
ml: അസാധുവായ തീയതി സ്ട്രിംഗ് %(datestr)s നൽകിയ ഫോർമാറ്റ് %(format)s

source: No %(verbose_name)s found matching the query
ml: ക്വറിയുമായി പൊരുത്തപ്പെടുന്ന %(verbose_name)s കണ്ടെത്തിയില്ല

source: Page is not last, nor can it be converted to an int.
ml: പേജ് അവസാനത്തേതല്ല, അല്ലെങ്കിൽ അതിനെ ഒരു int ആക്കി മാറ്റാൻ കഴിയില്ല.

source: Invalid page (%(page_number)s): %(message)s
ml: അസാധുവായ പേജ് (%(page_number)s): %(message)s

source: Empty list and %(class_name)s.allow_empty is False.
ml: ശൂന്യമായ ലിസ്റ്റും %(class_name)s.allow_empty False ഉം.

source: Directory indexes are not allowed here.
ml: ഡയറക്ടറി ഇൻഡെക്സുകൾ ഇവിടെ അനുവദനീയമല്ല.

source: %(path)s does not exist
ml: %(path)s നിലവിലില്ല

source: Index of %(directory)s
ml: %(directory)s ന്റെ ഇൻഡെക്സ്

source: The install worked successfully! Congratulations!
ml: ഇൻസ്റ്റാൾ വിജയകരമായി പൂർത്തിയായി! അഭിനന്ദനങ്ങൾ!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
ml: Django %(version)s-നുള്ള <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">റിലീസ് നോട്ടുകൾ</a> കാണുക

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
ml: നിങ്ങൾ ഈ പേജ് കാണുന്നത് <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> നിങ്ങളുടെ സെറ്റിംഗ് ഫയലിൽ ഉള്ളതിനാലും നിങ്ങൾ ഒരു URL-കളും കോൺഫിഗർ ചെയ്തിട്ടില്ലാത്തതിനാലുമാണ്.

source: Django Documentation
ml: Django ഡോക്യുമെന്റേഷൻ

source: Topics, references, &amp; how-tos
ml: വിഷയങ്ങൾ, റഫറൻസുകൾ, &amp; എങ്ങനെ-കൾ

source: Tutorial: A Polling App
ml: ട്യൂട്ടോറിയൽ: ഒരു പോളിംഗ് ആപ്പ്

source: Get started with Django
ml: Django ഉപയോഗിച്ച് ആരംഭിക്കുക

source: Django Community
ml: Django കമ്മ്യൂണിറ്റി

source: Connect, get help, or contribute
ml: കണക്റ്റുചെയ്യുക, സഹായം നേടുക, അല്ലെങ്കിൽ സംഭാവന ചെയ്യുക

source: Home | AGRICHAIN
ml: ഹോം | AGRICHAIN

source: Empowering Farmers with AGRICHAIN
ml: AGRICHAIN ഉപയോഗിച്ച് കർഷകരെ ശക്തിപ്പെടുത്തുന്നു

source: Revolutionizing agriculture through real-time data, predictive analytics, and direct farmer-to-customer connectivity.
ml: റിയൽ-ടൈം ഡാറ്റ, പ്രെഡിക്റ്റീവ് അനലിറ്റിക്സ്, നേരിട്ടുള്ള കർഷക-ടു-ഉപഭോക്തൃ കണക്റ്റിവിറ്റി എന്നിവയിലൂടെ കാർഷിക മേഖലയിൽ വിപ്ലവം സൃഷ്ടിക്കുന്നു.

source: Join Now
ml: ഇപ്പോൾ ചേരുക

source: Learn More
ml: കൂടുതൽ അറിയുക

source: Key Features of AGRICHAIN
ml: AGRICHAIN-ന്റെ പ്രധാന സവിശേഷതകൾ

source: Real-Time Crop Data
ml: റിയൽ-ടൈം ക്രോപ്പ് ഡാറ്റ

source: Access real-time data on crops cultivated in your region to avoid cultivation collisions and optimize resource utilization.
ml: നിങ്ങളുടെ പ്രദേശത്ത് കൃഷി ചെയ്യുന്ന ക്രോപ്പുകളെക്കുറിച്ചുള്ള റിയൽ-ടൈം ഡാറ്റ ആക്സസ് ചെയ്യുക, കൃഷി കൂട്ടിയിടികൾ ഒഴിവാക്കാനും വിഭവ ഉപയോഗം ഒപ്റ്റിമൈസ് ചെയ്യാനും.

source: Crop Diversification
ml: ക്രോപ്പ് ഡൈവേഴ്സിഫിക്കേഷൻ

source: Promote crop diversification to reduce surplus, improve soil health, and increase profitability.
ml: ക്രോപ്പ് ഡൈവേഴ്സിഫിക്കേഷൻ പ്രോത്സാഹിപ്പിക്കുക, സർപ്ലസ് കുറയ്ക്കാനും മണ്ണിന്റെ ആരോഗ്യം മെച്ചപ്പെടുത്താനും ലാഭം വർദ്ധിപ്പിക്കാനും.

source: Direct Farmer-to-Customer
ml: നേരിട്ടുള്ള കർഷക-ടു-ഉപഭോക്തൃ

source: Eliminate middlemen by connecting directly with consumers, ensuring fair pricing and higher profits for farmers.
ml: ഉപഭോക്താക്കളുമായി നേരിട്ട് കണക്റ്റുചെയ്യുക, കർഷകർക്ക് നീതിയുള്ള വിലനിർണ്ണയവും ഉയർന്ന ലാഭവും ഉറപ്പാക്കുക.

source: Climatic & Soil Forecasting
ml: കാലാവസ്ഥ & മണ്ണ് പ്രവചനം

source: Get actionable insights on climatic and soil conditions tailored to your locality for improved yield and resilience.
ml: നിങ്ങളുടെ പ്രദേശത്തിന് അനുയോജ്യമായ കാലാവസ്ഥയും മണ്ണിന്റെ അവസ്ഥയും സംബന്ധിച്ച പ്രവർത്തനാത്മക ഇൻസൈറ്റുകൾ നേടുക, ഉൽപ്പാദനവും പ്രതിരോധശേഷിയും മെച്ചപ്പെടുത്തുക.

source: Supply-Demand Analytics
ml: സപ്ലൈ-ഡിമാൻഡ് അനലിറ്റിക്സ്

source: Leverage predictive analytics to forecast supply-demand dynamics and redistribute surplus produce to regions in need.
ml: സപ്ലൈ-ഡിമാൻഡ് ഡൈനാമിക്സ് പ്രവചിക്കാനും സർപ്ലസ് ഉൽപ്പന്നങ്ങൾ ആവശ്യമുള്ള പ്രദേശങ്ങളിലേക്ക് വീണ്ടും വിതരണം ചെയ്യാനും പ്രെഡിക്റ്റീവ് അനലിറ്റിക്സ് ഉപയോഗിക്കുക.

source: Community Collaboration
ml: കമ്മ്യൂണിറ്റി സഹകരണം

source: Join a network of farmers, government agencies, and NGOs to share knowledge and build sustainable agricultural practices.
ml: കർഷകർ, സർക്കാർ ഏജൻസികൾ, എൻജിഒകൾ എന്നിവരുടെ ഒരു നെറ്റ്‌വർക്കിൽ ചേരുക, അറിവ് പങ്കിടുക, സുസ്ഥിര കാർഷിക പ്രയോഗങ്ങൾ നിർമ്മിക്കുക.

source: Our Programs
ml: ഞങ്ങളുടെ പ്രോഗ്രാമുകൾ

source: Government
ml: സർക്കാർ

source: Subsidy Program
ml: സബ്സിഡി പ്രോഗ്രാം

source: Crop Diversification Grants
ml: ക്രോപ്പ് ഡൈവേഴ്സിഫിക്കേഷൻ ഗ്രാന്റുകൾ

source: Financial support for farmers to adopt crop diversification and sustainable farming practices.
ml: ക്രോപ്പ് ഡൈവേഴ്സിഫിക്കേഷനും സുസ്ഥിര കാർഷിക പ്രയോഗങ്ങളും സ്വീകരിക്കാൻ കർഷകർക്ക് സാമ്പത്തിക പിന്തുണ.

source: Non-Profit
ml: ലാഭേച്ഛയില്ലാത്ത

source: Training Program
ml: പരിശീലന പ്രോഗ്രാം

source: Sustainable Farming Training
ml: സുസ്ഥിര കാർഷിക പരിശീലനം

source: Workshops on organic farming, water conservation, and soil health management.
ml: ഓർഗാനിക് ഫാർമിംഗ്, ജല സംരക്ഷണം, മണ്ണിന്റെ ആരോഗ്യ മാനേജ്മെന്റ് എന്നിവയെക്കുറിച്ചുള്ള വർക്ക്ഷോപ്പുകൾ.

source: Farmer
ml: കർഷകൻ

source: Marketplace Program
ml: മാർക്കറ്റ്പ്ലേസ് പ്രോഗ്രാം

source: Direct Marketplace Access
ml: നേരിട്ടുള്ള മാർക്കറ്റ്പ്ലേസ് ആക്സസ്

source: Sell your produce directly to consumers through our digital marketplace at fair prices.
ml: ഞങ്ങളുടെ ഡിജിറ്റൽ മാർക്കറ്റ്പ്ലേസിലൂടെ നിങ്ങളുടെ ഉൽപ്പന്നങ്ങൾ നേരിട്ട് ഉപഭോക്താക്കൾക്ക് നീതിയുള്ള വിലയിൽ വിൽക്കുക.

source: What Farmers Say
ml: കർഷകർ എന്തു പറയുന്നു
